<center><img src="http://i.imgur.com/sSaOozN.png" width="500"></center>

## Course: Computational Thinking for Governance Analytics

### Prof. José Manuel Magallanes, PhD 
* Visiting Professor of Computational Policy at Evans School of Public Policy and Governance, and eScience Institute Senior Data Science Fellow, University of Washington.
* Professor of Government and Political Methodology, Pontificia Universidad Católica del Perú. 


# Session 0: Introduction to Python Data Structures

_____
<a id='home'></a>

# 1.  Data Structures

Python has basic native structures, like lists, tuples and dictionaries.

## A.  **LISTS** 

Lists are the most flexible structure to save or contain data elements.

In [1]:
names=["Qing", "Françoise", "Raúl", "Bjork","Marie"]
ages=[32,33,28,30,29]
country=["China", "Senegal", "España", "Norway","Korea"]
education=["Bach", "Bach", "Master", "PhD","PhD"]

Above we have created some lists. Lists can contain any values. Lists support different operations:

* **Accessing**:

Keep in mind the positions in Python start in **0**.

In [2]:
# one element
ages[0]

32

In [3]:
# several, using slices:
ages[1:-1] #second to before last

[33, 28, 30]

In [4]:
# several, using slices:
ages[:-2] #all but two last ones

[32, 33, 28]

In [5]:
# non consecutive
from operator import itemgetter
list(itemgetter(0,2,3)(ages))

[32, 28, 30]

In [19]:
ages

[32, 33, 28, 30, 29]

In [23]:
# difficul to understand?
ages
ages[0:4:2] + [ages[3]]

[32, 28, 30]

In [16]:
type(ages[3])

int

* **Modifying**:

In [24]:
# by position
country[2]="Spain"

# list changed:
country

['China', 'Senegal', 'Spain', 'Norway', 'Korea']

In [25]:
# by value
country=["PR China" if x == "China" else x for x in country]

# list changed:
country

['PR China', 'Senegal', 'Spain', 'Norway', 'Korea']

* **Deleting**

In [26]:
# by position
del country[-1] #last value

# list changed:
country

['PR China', 'Senegal', 'Spain', 'Norway']

In [27]:
# by position
names.pop() #last value by default

# list changed:
names

['Qing', 'Françoise', 'Raúl', 'Bjork']

In [28]:
# only 'del' works for several positions

lista=[1,2,3,4,5,6]
del lista[1:3]

#now:
lista

[1, 4, 5, 6]

In [29]:
# by value
ages.remove(29) 

# list changed:
ages # just first ocurrence of value!!

[32, 33, 28, 30]

In [30]:
# by value
education.remove('PhD') 

# list changed:
education # just first ocurrence!!

['Bach', 'Bach', 'Master', 'PhD']

In [32]:
# deleting every  value:

lista=[1,'a',45,'b','a']
lista=[x for x in lista if x!='a']

# you get:
lista

[1, 45, 'b']

* **Inserting values**

In [33]:
# at the end
lista.append("abc")
lista

[1, 45, 'b', 'abc']

In [34]:
# PART ONE:
# first delete a position
education.pop(2)
education

['Bach', 'Bach', 'PhD']

In [35]:
# PART TWO:
# now insert in that position
education.insert(2,"Master")
education

['Bach', 'Bach', 'Master', 'PhD']

## B.  **TUPLES**

Tuples are inmutable structures in Python, they look like lists but do not share much of their functionality:

In [ ]:
# new list:
weekend=("Friday", "Saturday", "Sunday")

You can access:

In [ ]:
weekend[0]

But no other operation is allowed.

Python itself uses tuples as output of some important functions:

In [ ]:
zip(names,ages)

The **zip** functions creates tuples, by combining in parallel. You can see it if you turn the result into a list:

In [ ]:
list(zip(names,ages))  # a list of tuples

## C. **DICTIONARIES**  

*Dicts* work in a more sophisticated way, as they have a **'key'**:**'value'** structure:

In [44]:
classroom={'student':names,'age':ages,'edu':education}
# see it:

classroom

{'student': ['Qing', 'Françoise', 'Raúl', 'Bjork'],
 'age': [32, 33, 28, 30],
 'edu': ['Bach', 'Bach', 'Master', 'PhD']}

Dicts do not use indexes to access values:

In [38]:
#classroom[0]

Dicts use keys:

In [43]:
classroom['student']

['Qing', 'Françoise', 'Raúl', 'Bjork']

Notice I created a dictionary where the value is not ONE but a LIST of values.

Once you access a value, you can modify it. You can also use _pop_ or _del_ using the **keys**. But you can not use _append_ to add an element, you need **update**:

In [45]:
classroom.update({'country':country})
# now:
classroom

{'student': ['Qing', 'Françoise', 'Raúl', 'Bjork'],
 'age': [32, 33, 28, 30],
 'edu': ['Bach', 'Bach', 'Master', 'PhD'],
 'country': ['PR China', 'Senegal', 'Spain', 'Norway']}

## D. DATA FRAMES

**Data frames**  are more complex containers of values. The most common analogy is a spreadsheet. To create a data frame, we need to call **pandas**:

In [46]:
import pandas

We can prepare a data frame from a dictionary immediately, but ONLY if you have the same amount of elements in each list representing a column.

In [47]:
# our data frame:
students=pandas.DataFrame(classroom)
## see it:
students

     student  age     edu   country
0       Qing   32    Bach  PR China
1  Françoise   33    Bach   Senegal
2       Raúl   28  Master     Spain
3      Bjork   30     PhD    Norway

But, let me update the dictionary with:

In [48]:
names=["Qing", "Françoise", "Raúl", "Bjork","Marie"]
#
classroom.update({'student':names})
#
classroom

{'student': ['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie'],
 'age': [32, 33, 28, 30],
 'edu': ['Bach', 'Bach', 'Master', 'PhD'],
 'country': ['PR China', 'Senegal', 'Spain', 'Norway']}

We have five students, but only data for four of them. Then this does not work:

In [50]:
#pandas.DataFrame(classroom)

In [57]:
classroom.items()

dict_items([('student', ['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie']), ('age', [32, 33, 28, 30]), ('edu', ['Bach', 'Bach', 'Master', 'PhD']), ('country', ['PR China', 'Senegal', 'Spain', 'Norway'])])

In [61]:
[(a,pandas.Series(b)) for a, b in classroom.items()]

[('student',
  0         Qing
  1    Françoise
  2         Raúl
  3        Bjork
  4        Marie
  dtype: object),
 ('age',
  0    32
  1    33
  2    28
  3    30
  dtype: int64),
 ('edu',
  0      Bach
  1      Bach
  2    Master
  3       PhD
  dtype: object),
 ('country',
  0    PR China
  1     Senegal
  2       Spain
  3      Norway
  dtype: object)]

In that case, you need this:

In [62]:
#then
students=pandas.DataFrame({key:pandas.Series(value) for key, value in classroom.items()})

# seeing it:
students

     student   age     edu   country
0       Qing  32.0    Bach  PR China
1  Françoise  33.0    Bach   Senegal
2       Raúl  28.0  Master     Spain
3      Bjork  30.0     PhD    Norway
4      Marie   NaN     NaN       NaN

Sometimes, Python users code like this:

In [63]:
import pandas as pd # renaming the library

students=pd.DataFrame({key:pd.Series(value) for key, value in classroom.items()})
students

     student   age     edu   country
0       Qing  32.0    Bach  PR China
1  Françoise  33.0    Bach   Senegal
2       Raúl  28.0  Master     Spain
3      Bjork  30.0     PhD    Norway
4      Marie   NaN     NaN       NaN

### Data frame basic operations

In [64]:
# data of structure: list? tuple? dataframe?
type(students)

pandas.core.frame.DataFrame

In [65]:
# type of data in data frame column
students.dtypes

student     object
age        float64
edu         object
country     object
dtype: object

In [66]:
# details of data frame
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   student  5 non-null      object
 1   age      4 non-null      float64
 2   edu      4 non-null      object
 3   country  4 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

In [67]:
# number of rows and columns
students.shape

(5, 4)

In [68]:
# number of rows:
len(students)

5

In [69]:
# first rows
students.head(2) # compare with: students.tail(2)

     student   age   edu   country
0       Qing  32.0  Bach  PR China
1  Françoise  33.0  Bach   Senegal

In [70]:
# name of columns
students.columns

Index(['student', 'age', 'edu', 'country'], dtype='object')

If you needed the column names as a list:

In [71]:
students.columns.tolist()# or simply: list(students)

['student', 'age', 'edu', 'country']

If you needed a column values as a list:

In [72]:
students.age.tolist()# list(students.ages)

[32.0, 33.0, 28.0, 30.0, nan]

### Accesing elements in DF:

The data frames in pandas behave much like in R:

In [73]:
#one particular column
students.student

0         Qing
1    Françoise
2         Raúl
3        Bjork
4        Marie
Name: student, dtype: object

In [74]:
# or
students['student']

0         Qing
1    Françoise
2         Raúl
3        Bjork
4        Marie
Name: student, dtype: object

In [75]:
# it is not the same as: 
students[['student']] # a data frame, not a column (or series)

     student
0       Qing
1  Françoise
2       Raúl
3      Bjork
4      Marie

In [76]:
# this is also a DF
students[['country','student']]

    country    student
0  PR China       Qing
1   Senegal  Françoise
2     Spain       Raúl
3    Norway      Bjork
4       NaN      Marie

In [78]:
# and this, using loc:
columnNames=['country','student']
students.loc[:,columnNames]

    country    student
0  PR China       Qing
1   Senegal  Françoise
2     Spain       Raúl
3    Norway      Bjork
4       NaN      Marie

In [79]:
## Using positions is very common:
columnPositions=[1,3,0]
students.iloc[:,columnPositions]

    age   country    student
0  32.0  PR China       Qing
1  33.0   Senegal  Françoise
2  28.0     Spain       Raúl
3  30.0    Norway      Bjork
4   NaN       NaN      Marie

### Changing values

If you have a position, you can update values:

In [80]:
students.iloc[4,1]=23 # change is immediate! (no warning)
students

     student   age     edu   country
0       Qing  32.0    Bach  PR China
1  Françoise  33.0    Bach   Senegal
2       Raúl  28.0  Master     Spain
3      Bjork  30.0     PhD    Norway
4      Marie  23.0     NaN       NaN

### Deleting columns

You can modify any values in a data frame, but let me create a **deep** copy of this data frame to play with:

In [88]:
studentsCopy=students.copy()
studentsCopy

     student   age     edu   country
0       Qing  32.0    Bach  PR China
1  Françoise  33.0    Bach   Senegal
2       Raúl  28.0  Master     Spain
3      Bjork  30.0     PhD    Norway
4      Marie  23.0     NaN       NaN

In [82]:
# This is what you want get rid of:
byeColumns=['edu'] # you can delete more than one

#this is the result
studentsCopy.drop(columns=byeColumns)

     student   age   country
0       Qing  32.0  PR China
1  Françoise  33.0   Senegal
2       Raúl  28.0     Spain
3      Bjork  30.0    Norway
4      Marie  23.0       NaN

Notice you do not have saved the previous result:

In [83]:
studentsCopy

     student   age     edu   country
0       Qing  32.0    Bach  PR China
1  Françoise  33.0    Bach   Senegal
2       Raúl  28.0  Master     Spain
3      Bjork  30.0     PhD    Norway
4      Marie  23.0     NaN       NaN

In [84]:
#NOW we do
studentsCopy.drop(columns=byeColumns,inplace=True)

In [85]:
#then:
studentsCopy

     student   age   country
0       Qing  32.0  PR China
1  Françoise  33.0   Senegal
2       Raúl  28.0     Spain
3      Bjork  30.0    Norway
4      Marie  23.0       NaN

### Deleting a row

Let me delete a row:

In [89]:
# axis 0 is delete by row
studentsCopy.drop(index=2,inplace=True) 
studentsCopy

     student   age   edu   country
0       Qing  32.0  Bach  PR China
1  Françoise  33.0  Bach   Senegal
3      Bjork  30.0   PhD    Norway
4      Marie  23.0   NaN       NaN

As you see, the index dissapeared. Then, you should reset the indexes:

In [90]:
studentsCopy.reset_index(drop=False,inplace=True)
studentsCopy

   index    student   age   edu   country
0      0       Qing  32.0  Bach  PR China
1      1  Françoise  33.0  Bach   Senegal
2      3      Bjork  30.0   PhD    Norway
3      4      Marie  23.0   NaN       NaN

In [92]:
?studentsCopy.reset_index